Les acteurs ont en moyenne quel âge ? données films et acteurs (champs age, birth year et start year)
***age moyen à date du film

1- Appel des deux tables - trie ordre croissant - reset index et drop colonne en trop pour les deux tables

2- Nettoyage de la base Movies :
         - Conservation uniquement des films titleType = movie
         - Retrait des films isadult
         - Suppresion colonne quine me sont plus utiles
         - Explode genre en plusieurs colonnes

3- Nettoyage de la base Actors :
        - Supprimer les acteurs nés avant 1800 pour alléger la base
        - Explode colonne primaryProfession et conserver actor actress
        - Retirer la colonne deathYear
        - Explode colonne knownForTitles en film 1 film 2 etc....
        
        


3- Joindre les tables et retrier :
    - Supprimer les films plus anciens que 1918
    - Suprimer les lignes ou l'âge de l'acteur n'est pas renseigné
(ce tri n'a pas été fait avant car cela permet de nattoyer la base acteurs/movies en même temps)

4 - Créer une colonne âge acteur dans le film : Date du film - date de naissance (startYear - birthYear)

5 - il me faudra une moyenne de cette colonne pour répondre à la question par année

In [167]:
import pandas as pd
from datetime import datetime
from datetime import timedelta
import numpy as np
import plotly.express as px 
import plotly.graph_objects as go 
import matplotlib.pyplot as plt
import seaborn as sns

## 1- Appel des trois tables - trie - reset index et drop colonne en trop pour les deux tables :
 actors = name.basics
 movies = title.basics
 title =

## Table Actors

In [168]:
# appel de la table acteurs

actors = pd.read_csv('https://datasets.imdbws.com/name.basics.tsv.gz', sep = '\t', low_memory=False)

ParserError: Error tokenizing data. C error: out of memory

In [ ]:
# tri des acteurs par date de naissance 
actors.sort_values(by=['birthYear'], inplace=True)

#reset index 
actors.reset_index(inplace=True)

#drop colonne index en double 
actors.drop('index',axis = 1, inplace=True)

In [ ]:
# check si l'ordre est bien modifié et l'index modifié

actors.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0784172,Lucio Anneo Seneca,0004,0065,writer,"tt0049203,tt0972562,tt0218822,tt0237666"
1,nm4511421,Megan Liz Smith,0012,\N,"miscellaneous,actress","tt3416744,tt1966378,tt10183848"
2,nm8810146,Paul Walsh,0021,\N,actor,"tt0098878,tt0314567,tt0093223"
3,nm0430769,Flavius Josephus,0037,0095,"writer,miscellaneous","tt0273236,tt0237666,tt0009573,tt0049833"
4,nm1306202,Plutarch,0046,0122,writer,"tt0237666,tt0272979,tt0056937,tt0472473"

In [ ]:
actors.shape # table brute

(11366782, 6)

## Table Movies

In [ ]:
# appel de la table films (j'ai pris title basics qui contient l'année du film)

movies = pd.read_csv('https://datasets.imdbws.com/title.basics.tsv.gz', sep = '\t', low_memory=False)
movies.sort_values('startYear', inplace=True)

In [ ]:
#reset index base movies
movies.reset_index(inplace=True)

#drop colonne index en double 
movies.drop('index',axis = 1, inplace=True)

In [ ]:
# check si l'ordre est bien modifié et l'index modifié
movies.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt3155794,short,Passage de Venus,Passage de Venus,0,1874,\N,1,"Documentary,Short"
1,tt14495706,short,La Rosace Magique,La Rosace Magique,0,1877,\N,1,"Animation,Short"
2,tt2221420,short,Sallie Gardner at a Gallop,Sallie Gardner at a Gallop,0,1878,\N,1,"Documentary,Short"
3,tt12592084,short,Le singe musicien,Le singe musicien,0,1878,\N,1,"Animation,Short"
4,tt7816420,short,Athlete Swinging a Pick,Athlete Swinging a Pick,0,1881,\N,1,"Documentary,Short"

In [ ]:
movies.shape # table brute

(8468615, 9)

## Table Title

In [ ]:
# appel de la table title
title = pd.read_csv("https://datasets.imdbws.com/title.principals.tsv.gz", sep="\t")

In [ ]:
# filtre par category actor and actress
title = title.loc[(title['category']=='actor')|(title['category']=='actress')]

In [ ]:
#reset index base title
title.reset_index(inplace=True)

#drop colonne index en double 
title.drop('index',axis = 1, inplace=True)

In [ ]:
# remplacer les \n par des nan
title.replace('\\N', np.nan, inplace=True)

In [ ]:
# check si l'index est bien modifié
title.head()

      tconst  ordering     nconst category  job        characters
0  tt0000005         1  nm0443482    actor  NaN    ["Blacksmith"]
1  tt0000005         2  nm0653042    actor  NaN     ["Assistant"]
2  tt0000007         1  nm0179163    actor  NaN               NaN
3  tt0000007         2  nm0183947    actor  NaN               NaN
4  tt0000008         1  nm0653028    actor  NaN  ["Sneezing Man"]

## 2-Nettoyage de la base Movies :
###          - Remplacer les \N par des nan
###          - Conservation uniquement des films titleType = movie
###          - Retrait des films isadult
###          - Suppresion des colonnes qui ne me sont plus utiles

###          - Explode genre en plusieurs colonnes

In [ ]:
# Remplacer les \N par des nan

movies.replace('\\N', np.nan, inplace=True)

In [ ]:
movies.head()

,tconst,primaryTitle,originalTitle,startYear,runtimeMinutes,firstGenre,secondyGenre
0,tt2210499,Birmingham,Birmingham,1896,61,Documentary,None
1,tt0229676,Reproduction of the Corbett and Fitzsimmons Fight,Reproduction of the Corbett and Fitzsimmons Fight,1897,NaN,Documentary,News
2,tt0236940,69th Regiment Passing in Review,69th Regiment Passing in Review,1898,NaN,Documentary,None
3,tt0235357,Dressing Paper Dolls,Dressing Paper Dolls,1898,NaN,Documentary,None
4,tt0138349,O Carnaval em Lisboa,O Carnaval em Lisboa,1898,NaN,Documentary,None

In [ ]:
#Conservation uniquement des films titleType = movie

movies = movies[movies['titleType'] == 'movie']

In [ ]:
# Retrait des films isadult 

movies = movies[movies['isAdult'] == '0']

In [ ]:
# supression des colonnes titleType, endYear, isAdult 

movies = movies.drop(columns=['titleType', 'endYear', 'isAdult'])

In [ ]:
movies.head(2)

In [ ]:
# change str en int sur les colonnes startYear et runtimeMinutes
movies.astype({'startYear': int})
movies.astype({'runtimeMinutes': int})

#je ne conserve que les durées entre 58mn et inf à 270mn
movies = movies[(movies['runtimeMinutes']>=58)&(movies['runtimeMinutes']<=270)]

In [ ]:
#reset index base movies (again !)
movies.reset_index(inplace=True)

#drop colonne index en double 
movies.drop('index',axis = 1, inplace=True)

In [ ]:
# table uniquement avec les données conservées
movies.shape

(584862, 6)

In [ ]:
movies.head()

,tconst,primaryTitle,originalTitle,startYear,runtimeMinutes,genres
0,tt2210499,Birmingham,Birmingham,1896,61,Documentary
1,tt0229676,Reproduction of the Corbett and Fitzsimmons Fight,Reproduction of the Corbett and Fitzsimmons Fight,1897,\N,"Documentary,News,Sport"
2,tt0236940,69th Regiment Passing in Review,69th Regiment Passing in Review,1898,\N,Documentary
3,tt0235357,Dressing Paper Dolls,Dressing Paper Dolls,1898,\N,Documentary
4,tt0138349,O Carnaval em Lisboa,O Carnaval em Lisboa,1898,\N,Documentary

In [ ]:
#Explode genre en plusieurs colonnes
movies[['firstGenre', 'secondyGenre', 'thirdGenre']] = movies['genres'].str.split(',', n=2, expand=True)

#drop colonne genres et thirdGenre
movies.drop(columns=['genres', 'thirdGenre'],axis = 1, inplace=True)

In [ ]:
movies.head()

,tconst,primaryTitle,originalTitle,startYear,runtimeMinutes,firstGenre,secondyGenre
0,tt2210499,Birmingham,Birmingham,1896,61,Documentary,None
1,tt0229676,Reproduction of the Corbett and Fitzsimmons Fight,Reproduction of the Corbett and Fitzsimmons Fight,1897,\N,Documentary,News
2,tt0236940,69th Regiment Passing in Review,69th Regiment Passing in Review,1898,\N,Documentary,None
3,tt0235357,Dressing Paper Dolls,Dressing Paper Dolls,1898,\N,Documentary,None
4,tt0138349,O Carnaval em Lisboa,O Carnaval em Lisboa,1898,\N,Documentary,None

In [ ]:
movies.shape

(584862, 7)

## 3- Nettoyage de la base Actors :
###        - Remplacer les \N par des nan
###        - Supprimer les lignes qui contiennent des nan dans la colonne birthYear  
###        - Retirer les colonnes qui ne me sont pas utiles
###        - Supprimer les acteurs nés avant 1800 + reset index

In [ ]:
# remplacer les \N pas des nan 

actors.replace('\\N', np.nan, inplace=True)

In [ ]:
# suppression des lignes qui comportent des Nan dans la colonne birthYear

actors.dropna(subset=['birthYear'], inplace=True)

In [ ]:
# Retirer les colonnes qui ne me sont pas utiles
actors.drop(columns=['deathYear', 'primaryProfession', 'knownForTitles'], inplace=True)

In [ ]:
# ne conserve que les rows actors nés avant 1800
actors = actors[actors['birthYear'] >= '1800']

#reset index base actors (again !)
actors.reset_index(inplace=True)

#drop colonne index en double (again !)
actors.drop('index',axis = 1, inplace=True)

In [ ]:
# check index
actors.head()

,nconst,primaryName,birthYear,primaryProfession,knownForTitles
0,nm3885064,Momin Khan Momin,1800,music_department,tt1645182
1,nm0353596,David Haggart,1801,writer,tt0064988
2,nm0486937,Joseph Lanner,1801,"soundtrack,composer,music_department","tt0080455,tt0031270,tt0024749,tt0036235"
3,nm0626587,Johann Nestroy,1801,"writer,soundtrack","tt0338389,tt0457357,tt0240548,tt0195893"
4,nm0333187,Christian Dietrich Grabbe,1801,writer,"tt0352909,tt0109781,tt0451590,tt0207421"

In [ ]:
# explode colonne primaryProfession
#actors[['firstProfession', 'secondProfession', 'thirdProfession']] = actors['primaryProfession'].str.split(',', n=2, expand=True)

#drop colonne primaryProfession
#actors.drop(columns=['primaryProfession'],axis = 1, inplace=True)

In [ ]:
# check dataframe actors
#actors.head()

In [ ]:
# Je ne garde que les acteurs/actrices de mes trois colonnes : firstProfession, secondProfession, thirdProfession

#actors = actors[(actors['firstProfession'].isin(['actress','actor'])) | ( actors['secondProfession'].isin(['actress','actor'])) | ( actors['thirdProfession'].isin(['actress','actor']))]

In [ ]:
#drop colums firstProfession, secondProfession, thirdProfession qui ne me sont plus utiles
#actors.drop(columns=['firstProfession','secondProfession', 'thirdProfession'],axis = 1, inplace=True)

## 3- Nettoyage de la base Title :
###        - Remplacer les \N par des nan
###        - dropna sur les cellules tconst non renseignées
###        - supprimer les colonnes inutiles

In [ ]:
# Remplacer les \N par des nan

title.replace('\\N', np.nan, inplace=True)

In [ ]:
#dropna sur les cellules startyear non renseignées

title.dropna(subset=['tconst'])

,tconst,ordering,nconst,category,job,characters
0,tt0000005,1,nm0443482,actor,NaN,"[""Blacksmith""]"
1,tt0000005,2,nm0653042,actor,NaN,"[""Assistant""]"
2,tt0000007,1,nm0179163,actor,NaN,NaN
3,tt0000007,2,nm0183947,actor,NaN,NaN
4,tt0000008,1,nm0653028,actor,NaN,"[""Sneezing Man""]"
...,...,...,...,...,...,...
18873947,tt9916856,4,nm10538647,actress,NaN,"[""Kathi""]"
18873948,tt9916880,1,nm1483166,actor,NaN,"[""Rude Ralph"",""Mischievous Mike"",""Jolly Josh""]"
18873949,tt9916880,2,nm0254176,actress,NaN,"[""Moody Margaret""]"
18873950,tt9916880,3,nm0286175,actor,NaN,"[""Dad"",""Aerobic Al"",""Nasty Nicola""]"
18873951,tt9916880,4,nm10535738,actress,NaN,"[""Horrid Henry""]"

In [ ]:
# suppression des colonnes inutiles

title.drop(columns=['ordering','job', 'characters'], inplace=True)

## 3- Joindre les tables et retrier :

In [ ]:
actors.head(2)

      nconst        primaryName birthYear     title1     title2 title3 title4
0  nm6368729  William H. Taylor      1827  tt0021511       None   None   None
1  nm0853014         Pop Taylor      1828  tt0015864  tt0009886   None   None

In [ ]:
movies.head(2)

,tconst,primaryTitle,originalTitle,startYear,runtimeMinutes,firstGenre,secondyGenre
0,tt2210499,Birmingham,Birmingham,1896,61,Documentary,None
1,tt0229676,Reproduction of the Corbett and Fitzsimmons Fight,Reproduction of the Corbett and Fitzsimmons Fight,1897,\N,Documentary,News

In [ ]:
title.head(2)

      tconst     nconst category
0  tt0000005  nm0443482    actor
1  tt0000005  nm0653042    actor

In [ ]:
#new_df_actors = pd.merge(title, movies,  how='left', left_on=['tconst'], right_on = ['tconst'])